Repository: 84000/data-translation-memory
Catalog: toh259-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ཡི་གེ་མེད་པའི་ཟ་མ་ཏོག་རྣམ་པར་སྣང་མཛད་ཀྱི་སྙིང་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra The Basket without Words, The Illuminator’s Matrix

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas.

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ།
en: The Blessed One was dwelling in Rājagṛha on Vulture Peak together with a great saṅgha of monastics.

source: །བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་ཐམས་ཅད་ཀྱང་རྒྱ་ཆེན་པོ་ཤེས་པ། ཐབས་ལ་མཁས་པ། གསལ་བ། ལེ་ལོ་མེད་པ། ཡི་གེ་སྒྲུབ་པ་ལ་མཁས་པ།
en: There were also many hundred sextillions of bodhisattvas, all with extensive knowledge, skilled in means, lucid, free from laziness, and skilled in their command of words.

source: གནས་དང་གནས་མ་ཡིན་པ་ཁོང་དུ་ཆུད་པར་བྱེད་པ།
en: They comprehended what is correct and what is incorrect.

source: རྣམ་པར་གྲོལ་བ་ཕུན་སུམ་ཚོགས་པ།
en: They were completely liberated.

source: འདུལ་བའི་མྱུ་གུ་དང་ལྡན་པ། ངོ་ཚ་ཤེས་པའི་ཡན་ལག་དང་ལྡན་པ། སྙིང་རྗེའི་བདག་ཉིད་ཅན། སེམས་ཅན་ལ་མཉེས་གཤིན་པ།
en: Endowed with the bud of discipline and the branch of conscience, they were compassionate by nature and affectionate toward sentient beings.

source: ཏིང་ངེ་འཛིན་མང་པོ་དང་ལྡན་པ། ཤེས་རབ་ཀྱི་ལག་པ་དང་ལྡན་པ། བླ་མ་ལ་སྲི་ཞུ་ཆེ་བ།
en: They had attained many meditative concentrations, possessed the hand of insight, and showed great respect to their teachers.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རིན་པོ་ཆེའི་གླིང་དང་མཚུངས་པ།
en: They resembled the bodhisattva great being Ratnadvīpa.

source: དགེ་བ་དང་མི་དགེ་བ་ཤེས་པ། གཡོ་ཁོང་དུ་ཆུད་པར་བྱེད་པ།
en: They knew what was virtuous and nonvirtuous and comprehended deception.

source: ངེས་པའི་ཚིག་དང་སྤོབས་པ་ཟད་མི་ཤེས་པ་དང་།
en: They comprehended both semantic elucidation and inexhaustible eloquence.

source: ཟུང་ཁོང་དུ་ཆུད་པར་བྱེད་པ། རྣམ་པར་རྒྱལ་བ་ཐོབ་པ། སེམས་ཅན་ཐམས་ཅད་ལ་ཁོང་དུ་ཆུད་པར་བྱེད་པ།
en: They had attained victory and they engendered comprehension in all sentient beings.

source: ཡང་དག་པའི་མཐའ་ལས་བྱུང་ཞིང་བརྟེན་པ།
en: They emerged from and relied upon the limit of reality.

source: ཤིན་ཏུ་དཔའ་བ། གནས་པ་མེད་པ།
en: Extremely heroic, they had no abode.

source: ཆོས་བླ་མའི་རང་བཞིན་ལ་ངེས་པ།
en: They were certain about the nature of the highest teachings.

source: རང་བཞིན་མེད་པའི་ཁྱད་པར་སེམས་པ་སྙིང་པོ་ལ་དཔའ་བ།
en: Their thoughts distinctly focused on the lack of inherent existence, they were courageous with regard to the matrix.

source: སྐྱེ་བ་ལ་སྨོད་པའི་སྐྱེས་བུ།
en: They were beings who despised rebirth.

source: ཆོས་ཁོང་དུ་ཆུད་པར་བྱེད་པ། མཚན་གྱི་གཞི་ཤེས་པ།
en: They comprehended phenomena and knew their bases of characterization.

source: ཡུལ་འཁོར་སྲུང་བ། ཡུལ་འཁོར་སྐྱོང་བ།
en: They were guardians and protectors of realms.

source: སྒྲ་གྲགས་པ།
en: They were renowned.

source: རྒྱལ་བའི་སྒྲ་དང་ལྡན་པ། རྣམ་པར་རྒྱལ་བའི་མཛོད་དང་ལྡན་པ། ཡི་གེ་མེད་པའི་སྙིང་པོ་དང་ལྡན་པ།
en: They were endowed with the conqueror’s voice, endowed with the treasury of conquest, and endowed with the matrix without words.

source: ཤིན་ཏུ་གཉིད་ཀྱིས་མ་ལོག་པ། ཡེ་ཤེས་ཀྱི་ཕུང་པོ་ལ་གཞོལ་བ། རང་གི་ལས་ལ་མངོན་པར་དགའ་བ། རང་གི་རིགས་བསྟེན་པ།
en: Absolutely awake and absorbed in the aggregate of knowledge, they delighted in their own actions and relied on those who were like them.

source: ཀུན་ཏུ་བཟང་བ། མཉམ་པ་ཉིད་ལ་དགའ་བ། རྣམ་པར་དག་པ།
en: They were good in every way, took delight in equality, and were completely pure.

source: རང་གི་རྒྱུད་དང་། ཕ་རོལ་གྱི་རྒྱུད་རྣམ་པར་སྦྱོང་བར་བྱེད་པ། རྣམ་པར་རྒྱལ་བ་ཐོབ་པ་ཤ་སྟག་ལ་འདི་ལྟ་སྟེ།
en: They had purified their own and others’ continuums and attained victory.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པར་རྒྱལ་བའི་དབྱངས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་སྒྲོགས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྒྱལ་བའི་གནས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་སྤྲུལ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྟོང་གི་འབྱུང་གནས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྨོན་ལམ་བརྩེགས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཁྱད་པར་སེམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་འཛིན་དང་།
en: Together there were the following: the bodhisattva great being Voice of Victory, the bodhisattva great being Dharma Speaker, the bodhisattva great being Conqueror’s Abode, the bodhisattva great being Emanation of the Dharma, the bodhisattva great being Source of a Thousand Attributes, the bodhisattva great being Aspirations Amassed, the bodhisattva great being Viśeṣacintin, the bodhisattva great being Dharaṇīdhara, the bodhisattva great being Jagatīndhara, the bodhisattva great being Melodious Song of the Earth, the bodhisattva great being Pratibhānasampad, the bodhisattva great being Supreme Accumulation, the bodhisattva great being Lotus Petal Eyes, the bodhisattva great being Lotus Face, and the bodhisattva great being Maṇicūḍa.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འགྲོ་བ་འཛིན་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སའི་སྒྲ་དབྱངས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤོབས་པ་ཕུན་སུམ་ཚོགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤིན་ཏུ་བརྩེགས་དང་།
en: The bodhisattva great being Mañjuśrī was also there together with bodhisattva great beings beyond number, all of whom were youthful.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་པད་མའི་འདབ་མའི་མིག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་པད་མའི་གདོང་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཙུག་ན་ནོར་བུ་དང་ཐབས་ཅིག་གོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇམ་པའི་དབྱངས་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བགྲང་བ་ལས་འདས་པ་ཐམས་ཅད་ཀྱང་གཞོན་ནུར་གྱུར་པ་ཤ་སྟག་དང་ལྷན་ཅིག །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་ཀྱང་རྒྱལ་ཚབ་ཏུ་གྱུར་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དང་ལྷན་ཅིག །
en: The bodhisattva great being Maitreya was also there together with bodhisattva great beings who were all regents, as many as the grains of sand in the Ganges.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཁྱད་པར་སེམས་ནི་བརྒྱ་བྱིན་དུ་མ་དང་ལྷན་ཅིག །
en: The bodhisattva great being Viśeṣacintin was there together with many Śakras.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ཏུ་བཟང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་སྙིང་པོ་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་ནི་འཁོར་ལོས་སྒྱུར་བ་དུ་མ་དག་དང་ལྷན་ཅིག །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཐུ་ཆེན་ཐོབ་དང་།
en: The bodhisattva great being Samantabhadra, the bodhisattva great being Ākāśagarbha, and the Four Great Kings were there together with a multitude of universal monarchs.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ནི་ཚངས་པ་དུ་མ་དག་དང་ལྷན་ཅིག །
en: The bodhisattva great being Mahāsthāmaprāpta and the bodhisattva great being Avalokiteśvara were there together with a multitude of Brahmās.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཐོང་བ་དོན་ཡོད་ནི་འཁོར་རྣམ་ཐོས་ཀྱི་བུ་དུ་མ་དག་དང་ལྷན་ཅིག །
en: The bodhisattva great being Amoghadarśin was there together with a retinue of a multitude of Vaiśravaṇas.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྐར་མའི་རྒྱལ་པོ་ནི་འཇིག་རྟེན་སྐྱོང་བ་ལྷག་མ་རྣམས་དང་ལྷན་ཅིག །
en: The bodhisattva great being Nakṣatrarāja was there together with the other guardians of the world.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡིད་གཉིས་འཇོམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་ནི་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་སེམས་དཔའི་ཆ་བྱད་འཛིན་པ་དུ་མ་དང་ལྷན་ཅིག །
en: The bodhisattva great being Destroyer of Doubt and the bodhisattva great being Sarvanīvaraṇaviṣkambhin were there together with many thus-gone ones bearing the appearance of bodhisattvas.

source: ཤ་ར་དྭ་ཏིའི་བུ་དང་། མཽད་གལ་གྱི་བུ་དང་། འོད་སྲུང་ཆེན་པོ་ལ་སོགས་པ་དགྲ་བཅོམ་པ་ཐམས་ཅད་དང་ཡང་ལྷན་ཅིག །
en: Śāradvatīputra, Maudgalyāyana, Mahākāśyapa, and so forth were there together with all the arhats.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགེ་མང་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཁྱད་པར་སེམས་ནི་ལྷའི་བུ་མོ་སྟོང་ཕྲག་དུ་མ་དག་དང་ལྷན་ཅིག་ཅིང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྨན་གྱི་རྒྱལ་པོ་དང་།
en: The bodhisattva great being Abundant Virtues and the bodhisattva great being Viśeṣacintin were there together with a multitude of thousands of goddesses.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྨན་ཡང་དག་བྱུང་དང་། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ན་ཟླ་བ་དང་ཉི་མ་རང་གི་གཟི་བརྗིད་སྙེམས་པ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ།
en: The bodhisattva great being Bhaiṣajyarāja, the bodhisattva great being Arisen from Remedies, and all the Moons and Suns in as many world systems of the ten directions as there are grains of sand in the Ganges, proud of their own splendor, proceeded to where the Blessed One was.

source: གང་གི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོད་པ་དེའི་ཚེ་འཛམ་བུའི་ཆུ་བོའི་གསེར་གྱི་མདུན་དུ་སྣག་ཚའི་ཡུག་བཞག་པ་དེ་བཞིན་དུ། ཟླ་བ་དང་ཉི་མ་དེ་དག་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཕྱིར་ཞིང་མི་མཛེས། ཕྱིར་ཞིང་མི་འབར། ཕྱིར་ཞིང་ལམ་མེ་མ་ཡིན། ཕྱིར་ཞིང་ལྷན་ནེ་མ་ཡིན། ཕྱིར་ཞིང་ལྷང་ངེ་མ་ཡིན་ནོ།
en: When seated in the Blessed One’s presence, it was as if lumps of soot had been placed before gold from the Jambu River—those Moons and Suns were no longer beautiful, no longer blazed, no longer shone, no longer gleamed, and no longer illuminated in the Blessed One’s presence.

source: །སྲེད་མེད་ཀྱི་བུ་ལ་སོགས་པ་ལྷའི་ཚོགས་ཇི་སྙེད་པ་དང་། ཀླུའི་རྒྱལ་པོ་ཆུ་ལྷ་དང་། འཇོག་པོ་དང་། མ་དྲོས་པ་ལ་སོགས་པ་ཀླུའི་རྒྱལ་པོ་འཁོར་དང་བཅས་པ་ཐམས་ཅད་དང་། དྲི་ཟའི་བདག་པོ་ཤིན་ཏུ་ཡིད་དུ་འོང་བ་ནི་དྲི་ཟ་བྱེ་བ་ཕྲག་དུ་མ་དང་ལྷན་ཅིག་ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་དྲི་མ་མེད་པ་ཆེན་པོ་ནི་ནམ་མཁའ་ལྡིང་བྱེ་བ་ཕྲག་བདུན་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་ངོ་།
en: All the assemblies of gods such as Nārāyaṇa; all the kings of the nāgas such as Varuṇa, Takṣaka, and Anavatapta, together with their retinues; the lord of the gandharvas Sumanāpa together with many tens of millions of gandharvas; and the king of the garuḍas Great Stainless One together with seventy million garuḍas proceeded to the place where the Blessed One was.

source: །ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་ཇི་སྙེད་འཁོད་པ་དེ་དག་རང་རང་གི་དེ་བཞིན་གཤེགས་པ་ལས་གནང་བ་མནོས་ཏེ། འཁོར་བཞི་དག་དང་ལྷན་ཅིག་དོང་ནས། བཅོམ་ལྡན་འདས་དང་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་ཡང་འཇིག་རྟེན་ལས་འདས་པའི་མཆོད་པ་བྱས་ནས་རང་རང་གི་པད་མའི་སྟན་ལ་འཁོད་དོ།
en: All the bodhisattvas dwelling in as many world systems of the ten directions as there are grains of sand in the Ganges obtained permission from their respective thus-gone ones and, together with their fourfold assemblies, proceeded there and made supramundane offerings to the Blessed One and to the bodhisattvas and then sat on their respective lotus seats.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཁྱད་པར་སེམས་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །གལ་ཏེ་བདག་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་གནང་ན་བཅོམ་ལྡན་འདས་ལ་ཡི་གེ་གཉིས་ཤིག་ཞུ་ལགས་སོ།
en: Then the bodhisattva great being Viśeṣacintin said to the Blessed One, “If the Blessed One gives me permission, I would like to ask the Blessed One about two words.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One replied, “I give my permission.

source: ངས་གནང་གིས་ཁྱད་པར་སེམས་ཁྱོད་ཅི་བསམས་པ་དེ་བཞིན་གཤེགས་པ་ལ་དྲིས་ཤིག །
en: Therefore, Viśeṣacintin, ask the Thus-Gone One whatever you have in mind.

source: དེ་བཞིན་གཤེགས་པ་ནི་སེམས་ཅན་གཅིག་གི་དོན་གྱི་ཕྱིར་འདིར་བྱུང་བ་མ་ཡིན་གྱི་ང་ནི་ཁྱེད་ཀྱི་དོན་གྱི་ཕྱིར་འདིར་བྱུང་ངོ་།
en: The Thus-Gone One did not appear here for the sake of just anyone's benefit, I appeared here for the sake of your benefit.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཁྱད་པར་སེམས་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔས་གང་སྤང་བར་བགྱི་བའི་ཆོས་གཅིག་པོ་དེ་གང་ལགས།
en: Then the bodhisattva Viśeṣacintin asked the Blessed One, “Blessed One, what is one factor that bodhisattvas abandon?

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔས་གང་བསྲུངས་ན་བསླབ་པའི་གཞི་ཐམས་ཅད་ཡོངས་སུ་བཟུང་བར་འགྱུར་བའི་ཆོས་གཅིག་པོ་དེ་གང་ལགས།
en: Blessed One, what is one quality that, when safeguarded by bodhisattvas, encompasses all the foundations of the training?

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་གང་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་གཅིག་པོ་དེ་གང་ལགས། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Blessed One, what is one phenomenon to which thus-gone ones have truly and perfectly awakened?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཁྱད་པར་སེམས་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: Questioned in this way, the Blessed One gave his approval to the bodhisattva Viśeṣacintin. “

source: ཚངས་པ་དེ་སྐད་སྨྲ་བ་ནི་ལེགས་སོ་ལེགས་སོ།
en: Brahmā, the words you have spoken are excellent, excellent!

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་སྤོབས་པ་འདི་ལྟ་བུ་བྱུང་ངོ་།
en: Child of a good family, such eloquence arises through the Thus-Gone One’s blessing.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པས་བྱིན་གྱིས་བརླབས་པ་མ་མཛད་ན། དེ་བཞིན་གཤེགས་པ་ལ་སུ་ཡང་ཞུ་བ་འདི་ལྟ་བུ་ཞུ་བར་མི་འགྱུར་རོ།
en: Child of a good family, if the Thus-Gone One did not bestow blessings, no one would ask the Thus-Gone One such questions.

source: །ཁྱད་པར་སེམས་དེའི་ཕྱིར་ཁྱོད་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་ཁྱོད་ལ་བཤད་དོ།
en: Viśeṣacintin, because of that, you should listen very carefully and keep this in mind. I will explain this to you.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། བྱང་ཆུབ་སེམས་དཔའ་ཁྱད་པར་སེམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་།
en: After the Blessed One said this, the bodhisattva Viśeṣacintin listened to the Blessed One accordingly.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་ཆོས་གཅིག་གང་སྤང་བར་བྱ་བའི་ཆོས་གཅིག་པོ་གང་ཞེ་ན།
en: The Blessed One said to him, “Child of a good family, someone may ask, ‘What is one factor that bodhisattvas should abandon?’

source: འདི་ལྟ་སྟེ། འདོད་ཆགས་ཀྱི་ཆོས་ཏེ།
en: It is the quality of attachment.

source: རིགས་ཀྱི་བུ་འདི་ནི་སྤང་བར་བྱ་བའི་ཆོས་གཅིག་གོ།
en: Child of a good family, this is one factor that should be abandoned.

source: །ཡང་སྤང་བར་བྱ་བའི་ཆོས་གཅིག་སྟེ། འདི་ལྟར་ཞེ་སྡང་གི་ཆོས་ཏེ།
en: Moreover, one factor that should be abandoned is the quality of anger.

source: འདི་ནི་སྤང་བར་བྱ་བའི་ཆོས་གཅིག་གོ།
en: This is one factor that should be abandoned.

source: །ཡང་སྤང་བར་བྱ་བའི་ཆོས་གཅིག་སྟེ། འདི་ལྟར་གཏི་མུག་གི་ཆོས་ཏེ།
en: Moreover, one factor that should be abandoned is the quality of delusion.

source: །ཡང་སྤང་བར་བྱ་བའི་ཆོས་གཅིག་སྟེ། འདི་ལྟར་བདག་ཏུ་འཛིན་པ་སྟེ།
en: Moreover, one factor that should be abandoned is grasping at a self.

source: །ཡང་སྤང་བར་བྱ་བའི་ཆོས་གཅིག་སྟེ། འདི་ལྟར་ལེ་ལོ་སྟེ།
en: Moreover, one factor that should be abandoned is laziness.

source: །ཡང་སྤང་བར་བྱ་བའི་ཆོས་གཅིག་སྟེ། འདི་ལྟར་རྨུགས་པ་དང་གཉིད་དེ།
en: Moreover, one factor that should be abandoned is lethargy and sleepiness.

source: །ཡང་སྤང་བར་བྱ་བའི་ཆོས་གཅིག་སྟེ། འདི་ལྟར་སྲེད་པ་སྟེ།
en: Moreover, one factor that should be abandoned is craving.

source: །རིགས་ཀྱི་བུ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སྤང་བར་བྱ་བའི་ཆོས་གཅིག་སྟེ། འདི་ལྟར་མ་རིག་པ་སྟེ།
en: Child of a good family, moreover, one factor that bodhisattvas should abandon is ignorance.

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔས་སྤང་བར་བྱ་བའི་ཆོས་གཅིག་གོ།
en: Child of a good family, this is one factor that bodhisattvas should abandon. “

source: །རིགས་ཀྱི་བུ་གང་བྱང་ཆུབ་སེམས་དཔས་རྟག་པར་རྒྱུན་དུ་མངོན་པར་བསྲུང་བར་བྱ་བའི་ཆོས་གཅིག་པོ་དེ་གང་ཞེ་ན།
en: Child of a good family, someone may ask, ‘What is one quality that bodhisattvas should constantly and continuously safeguard?’

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་གང་བདག་མི་འདོད་པ་དེ་གཞན་དག་ལ་མི་བྱའོ།
en: Child of a good family, whatever bodhisattvas do not desire, they should not do to others.

source: །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་གང་ལ་ལ་ཞིག་ཆོས་གཅིག་པོ་དེ་སྲུང་ན། དེས་དེ་བཞིན་གཤེགས་པའི་བསླབ་པའི་གཞི་ཐམས་ཅད་བསྲུངས་པར་འགྱུར་རོ།
en: Child of a good family, those bodhisattvas who safeguard this one quality will thereby safeguard all the foundations of the thus-gone ones’ training.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is this so?

source: རིགས་ཀྱི་བུ་གང་བདག་གི་སྲོག་ཕངས་པར་འཛིན་པ་དེ་སྲོག་མི་གཅོད་དོ།
en: Child of a good family, whoever values their own life does not kill.

source: །གང་བདག་གི་ནོར་ཕངས་པར་འཛིན་པ་དེ་མ་བྱིན་པར་མི་ལེན་ཏོ།
en: Whoever values their own wealth does not take what has not been given.

source: །གང་བདག་གི་ཆུང་མ་ཕངས་པར་འཛིན་པ་དེ་གཞན་གྱི་ཆུང་མའི་གན་དུ་མི་འགྲོའོ།
en: Whoever values their wife does not approach another’s wife.

source: །རིགས་ཀྱི་བུ་དེ་ལ་སོགས་ཏེ། གང་ལ་ལ་ཞིག་འདི་སྙམ་དུ་དེ་བཞིན་གཤེགས་པའི་བཀའ་བཞིན་དུ་བྱའོ་སྙམ་དུ་སེམས་པ་དེས་ཆོས་གཅིག་པོ་འདི་བསྲུང་བར་བྱའོ་ཞེས་བཤད་དོ།
en: Child of a good family, I have explained that those who think in these or similar ways and understand, 'I should act in accordance with the Thus-Gone One’s teachings," should safeguard this one quality. “

source: རིགས་ཀྱི་བུ་གང་ལ་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དོན་དུ་གཉེར་བ་དེ་དག་ཐམས་ཅད་ནི་རང་གི་བདེ་བའི་རྒྱུར་དོན་དུ་གཉེར་གྱི།
en: Child of a good family, all those who seek unsurpassed, perfect, and complete awakening seek the causes of their own happiness.

source: །སུ་ཡང་བདག་སྡུག་བསྔལ་བ་མི་འདོད་དེ། འགྲོ་བ་ནི་བདེ་བ་འདོད་ཅེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: That means that no one desires their own suffering; beings desire happiness.

source: །གང་ཁྱེད་ཅག་མི་འདོད་པ་དེ་གཞན་དག་ལ་མ་བྱེད་ཅིག་ཅེས་ང་སྨྲའོ།
en: I say, ‘Do not do to others what you do not desire.’

source: །རིགས་ཀྱི་བུ་འདི་ནི་གང་བྱང་ཆུབ་སེམས་དཔས་རྟག་པར་རྒྱུན་དུ་མངོན་པར་བསྲུང་བར་བྱ་བའི་ཆོས་གཅིག་གོ།
en: Child of a good family, this is one quality that bodhisattvas should constantly and continuously safeguard. “

source: །རིགས་ཀྱི་བུ་གང་དེ་བཞིན་གཤེགས་པས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་གཅིག་པོ་དེ་གང་ཡིན་ཞེས་དེ་སྐད་ཟེར་བ་ནི་རིགས་ཀྱི་བུ་གང་དེ་བཞིན་གཤེགས་པས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་གཅིག་པོ་དེ་གང་ཡང་མེད་དོ།
en: Child of a good family, someone may ask, ‘What is one phenomenon to which thus-gone ones have truly and perfectly awakened?’ Child of a good family, there is no one phenomenon to which thus-gone ones have truly and perfectly awakened.

source: །རིགས་ཀྱི་བུ་གང་ལ་ཆོས་གང་ཡང་རྟོགས་པ་མེད་པ་དེ་དེ་བཞིན་གཤེགས་པས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའོ།
en: Child of a good family, without any phenomenon whatsoever to realize, thus-gone ones have truly and perfectly awakened. “

source: །རིགས་ཀྱི་བུ་ཡང་དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་མ་སྐྱེས་པར་ཐུགས་སུ་ཆུད་དོ།
en: Child of a good family, thus-gone ones also comprehend that all phenomena are unborn.

source: །དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་འགགས་པ་མེད་པར་ཐུགས་སུ་ཆུད་དོ།
en: Thus-gone ones comprehend that all phenomena are without cessation.

source: །རིགས་ཀྱི་བུ་ཡང་དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་མཐའ་གཉིས་ལས་གྲོལ་བར་ཐུགས་སུ་ཆུད་དོ།
en: Child of a good family, thus-gone ones also comprehend that all phenomena are free from the two extremes.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་མ་བྱུང་བར་ཐུགས་སུ་ཆུད་དོ།
en: Child of a good family, thus-gone ones comprehend that all phenomena are unarisen.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པས་ལས་བདག་གིར་བྱ་བར་ཐུགས་སུ་ཆུད་དོ།
en: Child of a good family, thus-gone ones comprehend the appropriation of karma.

source: །དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་རྒྱུ་དང་རྐྱེན་ལས་རག་ལས་པར་ཐུགས་སུ་ཆུད་དོ།
en: Thus-gone ones comprehend that all phenomena depend on causes and conditions.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པས་རྒྱུ་དང་རྐྱེན་ནི་གློག་དང་འདྲ་བར་ཐུགས་སུ་ཆུད་དོ།
en: Child of a good family, thus-gone ones comprehend that causes and conditions are like lightning.

source: །དེ་བཞིན་གཤེགས་པས་རྒྱུ་དང་རྐྱེན་མེད་པ་ལས་སྐྱེ་བ་མེད་པར་ཐུགས་སུ་ཆུད་དོ།
en: Thus-gone ones comprehend that there is no birth without causes and conditions.

source: །དེ་ལྟར་དེ་བཞིན་གཤེགས་པས་རྣམ་པར་སྣང་མཛད་ཀྱི་སྙིང་པོའི་ཆོས་ཉིད་ཐུགས་སུ་ཆུད་དོ།
en: In this way, thus-gone ones comprehend the true nature that is the illuminator’s matrix. “

source: །ཅིའི་ཕྱིར་ཡོངས་སུ་རྟོག་པ་དག་རྣམ་པར་སྣང་མཛད་ཀྱི་སྙིང་པོ་ཞེས་སྨྲ་ཞེ་ན།
en: Someone may ask, ‘Why are these realizations called the illuminator’s matrix?’

source: རིགས་ཀྱི་བུ་འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཡེ་ཤེས་ལ་སོགས་པ་གང་དག་ཅི་འབྱུང་བའི་མངལ་དེ་ཡིན་པའི་ཕྱིར་རོ།
en: Child of a good family, this is because they are the womb from which all mundane and supramundane wisdom and so forth arises.

source: །གང་གི་ཚེ་ཡེ་ཤེས་དེའི་རང་བཞིན་ལ་ཡོངས་སུ་རྟོག་པ་དེའི་ཚེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མངལ་དུ་ཆུད་པ་ཡིན་ཏེ།
en: When one examines the nature of that wisdom, then one enters the womb of the perfection of wisdom.

source: དེའི་ཚེ་རྣམ་པར་སྣང་མཛད་ཀྱི་སྙིང་པོ་ཞེས་བྱ་བའི་མིང་འཐོབ་བོ།
en: That is called the illuminator’s matrix. “

source: །རིགས་ཀྱི་བུ་ཡང་དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་སྒྱུ་མ་དང་སྨིག་རྒྱུ་དང་འདྲ་བར་ཐུགས་སུ་ཆུད་དོ།
en: Child of a good family, thus-gone ones also comprehend that all phenomena are like a magician’s illusions and like mirages.

source: །དེ་བཞིན་གཤེགས་པས་རང་བཞིན་གྱིས་རྣམ་པར་གྲོལ་བའི་རང་གི་ཆོས་ཉིད་ཐུགས་སུ་ཆུད་དོ།
en: Thus-gone ones comprehend their own true nature that is naturally liberated.

source: །རྣམ་པར་གྲོལ་བ་གང་ཡིན་པ་དེ་རྣམ་པར་སྣང་མཛད་ཀྱི་སྙིང་པོའི་ཆོས་ཉིད་དོ།
en: That which is liberated is the true nature of the illuminator’s matrix. “

source: །རིགས་ཀྱི་བུ་ཡང་དེ་བཞིན་གཤེགས་པས་ཆོས་ཀྱི་སྒོ་གཅིག་ཐུགས་སུ་ཆུད་དེ། རིགས་ཀྱི་བུ་གང་ལ་འགྲོ་བ་མེད་པ་དང་། འོང་བ་མེད་པ་དང་། རྒྱུ་མེད་པ་དང་། རྐྱེན་མེད་པ་དང་། འཆི་འཕོ་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་དང་། བླང་བ་མེད་པ་དང་། དོར་བ་མེད་པ་དང་།
en: Child of a good family, thus-gone ones also comprehend the single gateway of the Dharma.

source: འགྲིབ་པ་མེད་པ་དང་། འཕེལ་བ་མེད་པ་དང་། རིགས་ཀྱི་བུ་གང་རང་བཞིན་གྱིས་རང་བཞིན་མེད་དེ། གང་ལ་དཔེར་བྱ་བར་མི་ནུས་པ་དང་། གང་ཡི་གེ་དང་ངེས་པའི་ཚིག་གིས་བརྗོད་པར་མི་ནུས་པའི་ཆོས་ཀྱི་སྒོ་གཅིག་པོ་དེ་དེ་བཞིན་གཤེགས་པས་ཐུགས་སུ་ཆུད་དོ།
en: Child of a good family, that which is without going, without coming, without causes, without conditions, without death and transmigration, without birth, without acceptance, without rejection, without decrease, and without increase; and, child of a good family, what is naturally natureless, what cannot be indicated by analogy, what cannot be expressed by words or language—that single gateway of the Dharma is comprehended by the thus-gone ones.”

source: །བཀོད་པའི་རྒྱལ་པོ་བསྟན་པ་ཡི་གེ་མེད་པའི་ཟ་མ་ཏོག་རྣམ་པར་སྣང་མཛད་ཀྱི་སྙིང་པོའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན་ས་བཅུ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་མིག་ལ་རྡུལ་ཕྲ་རབ་ཇི་སྙེད་སྣང་བར་འགྱུར་བ་དེ་སྙེད་ཀྱི་སེམས་ཅན་རྣམས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །དེ་སྙེད་གཅིག་གིས་དགྲ་བཅོམ་པ་ཉིད་མངོན་དུ་བྱས་སོ།
en: When the teaching of the king of arrays, this Dharma discourse on the basket without words, the illuminator’s matrix, was explained, as many sentient beings as the minute particles that would appear to the eyes of a bodhisattva abiding on the tenth ground generated the mind of unsurpassed, perfect, and complete awakening.

source: །དེ་བས་ཆེས་མང་བའི་སེམས་ཅན་དག་སེམས་ཅན་དམྱལ་བ་ནས་ཤི་འཕོས་ནས་ལྷ་དང་མིར་སྐྱེས་སོ།
en: The same number attained arhatship. Moreover, an even greater number of sentient beings than that died and transmigrated from among the hell beings and were born as humans and gods.

source: །བྱང་ཆུབ་སེམས་དཔའ་དུ་མ་ནི་ས་ཐོབ་པར་གྱུར་ཏོ།
en: Many bodhisattvas attained the grounds.

source: །བྱང་ཆུབ་སེམས་དཔའ་དུ་མ་ནི་ཏིང་ངེ་འཛིན་བརྒྱ་སྟོང་མངོན་དུ་གྱུར་ཏོ།
en: Many bodhisattvas actualized hundreds of thousands of meditative concentrations.

source: །མང་དུ་ཅི་དགོས་ཏེ་གཏམ་འདི་ནི་སུ་ལ་ཡང་དོན་མེད་པར་མ་གྱུར་ཏོ།
en: Many found that due to this discourse they did not lack anything they needed.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་སྒྲ་གཅན་ཟིན་ལ་བཀའ་སྩལ་པ། སྒྲ་གཅན་ཟིན་ཁྱོད་ངའི་ཆོས་ཀྱི་ཚུལ་འདི་གཟུང་བར་སྤྲོ་བར་གྱིས་ཤིག །
en: Then the Blessed One said to Venerable Rāhula, “Rāhula, you should remember this Dharma instruction of mine enthusiastically.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་མ་ཐག་ཏུ་སངས་རྒྱས་ཀྱི་མཐུས་འཁོར་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་དགུ་སྟན་ལས་ལངས་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་ཚུལ་འདི་བདག་ཅག་གིས་གཟུང་བར་བགྱིའོ།
en: Immediately after the Blessed One spoke, by the power of the Buddha, ninety million bodhisattvas from that retinue arose from their seats and said to the Blessed One, “Blessed One, we will remember this Dharma instruction of the Thus-Gone One.
